<a href="https://colab.research.google.com/github/zzoobro/tongteuk/blob/main/prac2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 0325 R practice

## 라이브러리 설치

In [1]:
install.packages('tidyverse')
library(tidyverse)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.3.3     ✔ purrr   0.3.4
✔ tibble  3.1.0     ✔ dplyr   1.0.5
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

## pivot 함수 연습

In [9]:
# pivot_longer

print('변경 전 table4a')
table4a

print('\n')
print('table4a의 1999, 2000 열을 year라는 변수로, 그 값을 cases라는 변수로 만들기')
print('\n')

print('변경 후 table4a')
table4a %>%
  pivot_longer(c('1999', '2000'), names_to='year', values_to='cases')

[1] "변경 전 table4a"

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

[1] "\n"
[1] "table4a의 1999, 2000 열을 year라는 변수로, 그 값을 cases라는 변수로 만들기"
[1] "\n"
[1] "변경 후 table4a"

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [10]:
# pivot_longer

print('변경 전 table4b')
table4a

print('\n')
print('table4b의 1999, 2000 열을 year라는 변수로, 그 값을 population이라는 변수로 만들기')
print('\n')

print('변경 후 table4b')
table4b %>%
  pivot_longer(c('1999', '2000'), names_to='year', values_to='population')

[1] "변경 전 table4b"

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

[1] "\n"
[1] "table4b의 1999, 2000 열을 year라는 변수로, 그 값을 population이라는 변수로 만들기"
[1] "\n"
[1] "변경 후 table4b"

  country     year population
1 Afghanistan 1999   19987071
2 Afghanistan 2000   20595360
3 Brazil      1999  172006362
4 Brazil      2000  174504898
5 China       1999 1272915272
6 China       2000 1280428583

In [13]:
# pivot_wider

print('변경 전 table2')
table2

print('\n')
print('table2의 type 열에서 정보를 가져와 열을 새로 만들고 그 값을 count라는 변수에서 가져오기')
print('\n')

print('변경 후 table2')
table2 %>%
  pivot_wider(names_from='type', values_from='count')

[1] "변경 전 table2"

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

[1] "\n"
[1] "table2의 type 열에서 정보를 가져와 열을 새로 만들고 그 값을 count라는 변수에서 가져오기"
[1] "\n"
[1] "변경 후 table2"

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [14]:
# separate

print('변경 전 table3')
table3

print('\n')
print('table3의 rate 변수에서 숫자가 아닌 구분자로 나누어 앞은 cases변수로, 뒤는 population 변수로 가져오기')
print('\n')

print('변경 후 table3')
table3 %>%
  separate(rate, into=c('cases', 'population'))

[1] "변경 전 table3"

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

[1] "\n"
[1] "table3의 rate 변수에서 숫자가 아닌 구분자로 나누어 앞은 cases변수로, 뒤는 population 변수로 가져오기"
[1] "\n"
[1] "변경 후 table3"

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [16]:
# unite

print('변경 전 table5')
table5

print('\n')
print('table5에서 연도의 앞 두 글자와 뒤 두 글자를 합쳐서 Year 변수로 저장하기')
print('\n')

print('변경 후 table5')
table5 %>%
  unite(Year, century, year, sep='')

[1] "변경 전 table5"

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

[1] "\n"
[1] "table5에서 연도의 앞 두 글자와 뒤 두 글자를 합쳐서 Year 변수로 저장하기"
[1] "\n"
[1] "변경 후 table5"

  country     Year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

## for loops

In [17]:
df = tibble(
  a = rnorm(10),
  b = rnorm(10),
  c = rnorm(10),
  d = rnorm(10),
)

df

   a           b          c          d
1  -1.48621759 -0.8734975  0.5326020  1.6392777
2   0.13449875  1.3306858  0.9472828  0.7756583
3  -0.02771022  0.3590375  0.2180899 -1.3527187
4   2.70625151 -0.6034285 -1.0964486  0.4310400
5  -0.91338979 -0.3831223 -0.2141451 -0.8863090
6  -0.49107554 -0.3765796  1.2075391  0.3874823
7   1.37674937  1.3601907  1.1334497 -1.3031757
8  -1.40383465 -0.0507211  1.1708618  1.7133479
9  -1.30655587  1.0479394 -0.4184720 -0.4353382
10 -0.48355106  0.4182673  1.6022822  1.2273613

In [30]:
# for loops 이용한 함수 정의

col_mean = function(df) {

  output = vector('double', ncol(df))

  for(i in 1:ncol(df)){
    output[i] = mean(df[[i]])
  }
  return(output)
}

col_median = function(df) {

  output = vector('double', ncol(df))

  for(i in 1:ncol(df)){
    output[i] = median(df[[i]])
  }
  return(output)
}

col_sd = function(df) {

  output = vector('double', ncol(df))

  for(i in 1:ncol(df)){
    output[i] = sd(df[[i]])
  }
  return(output)
}

In [31]:
col_mean(df=df)
col_median(df=df)
col_sd(df=df)

[1] -0.1894835  0.2228772  0.5083042  0.2196626

[1] -0.4873133  0.1541582  0.7399424  0.4092612

[1] 1.3364544 0.8127064 0.8659678 1.1589005

## map function(purrr library)